/*
 * @Description: 
 * @Date: 2022-10-07 17:12:40
 * @LastEditTime: 2022-10-07 17:27:28
 */
// 手机号码正则表达式验证。
function checkPhone(){ 
    var phone = document.getElementById('phone').value;
    if(!(/^1[34578]\d{9}$/.test(phone))){ 
        alert("手机号码有误，请重填");  
        return false; 
    } 
}
// 或者
function checkPhone(){ 
    var phone = document.getElementById('phone').value;
    if(!(/^1(3|4|5|7|8)\d{9}$/.test(phone))){ 
        alert("手机号码有误，请重填");  
        return false; 
    } 
}

// 固定电话号码正则表达式：
 function checkTel(){
    var tel = document.getElementById('tel').value;
    if(!/^(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}$/.test(tel)){
        alert('固定电话有误，请重填');
        return false;
    }
}
// 身份证正则：
//身份证正则表达式(15位)
isIDCard1=/^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/;
//身份证正则表达式(18位)
isIDCard2=/^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{4}$/;
// 身份证正则合并：(^\d{15}$)|(^\d{17}([0-9]|X)$)

// 请输入大于0的数字，且小数点不能多于2位：/^([1-9]\d*(\.\d{1,2})?|([0](\.([0][1-9]|[1-9]\d{0,1}))))$/
// 数字必须在0到100之间(包括0): /^(\d?\d(\.\d*)?|100)$/
// 验证数字：^[0-9]*$ 
// 验证n位的数字：^\d{n}$ 
// 验证至少n位数字：^\d{n,}$ 
// 验证m-n位的数字：^\d{m,n}$ 
// 验证零和非零开头的数字：^(0|[1-9][0-9]*)$ 
// 验证有两位小数的正实数：^[0-9]+(.[0-9]{2})?$ 
// 验证有1-3位小数的正实数：^[0-9]+(.[0-9]{1,3})?$ 
// 验证非零的正整数：^\+?[1-9][0-9]*$ 
// 验证非零的负整数：^\-[1-9][0-9]*$ 
// 验证非负整数（正整数 + 0） ^\d+$ 
// 验证非正整数（负整数 + 0） ^((-\d+)|(0+))$ 
// 验证长度为3的字符：^.{3}$ 
// 验证由26个英文字母组成的字符串：^[A-Za-z]+$ 
// 验证由26个大写英文字母组成的字符串：^[A-Z]+$ 
// 验证由26个小写英文字母组成的字符串：^[a-z]+$ 
// 验证由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$ 
// 验证由数字、26个英文字母或者下划线组成的字符串：^\w+$ 
// 验证用户密码:^[a-zA-Z]\w{5,17}$ 正确格式为：以字母开头，长度在6-18之间，只能包含字符、数字和下划线。 
// 验证是否含有 ^%&',;=?$\" 等字符：[^%&',;=?$\x22]+ 
// 验证汉字：^[\u4e00-\u9fa5],{0,}$ 
// 验证Email地址：/^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$/
// 验证InternetURL：^http://([\w-]+\.)+[\w-]+(/[\w-./?%&=]*)?$ ；^[a-zA-z]+://(w+(-w+)*)(.(w+(-w+)*))*(?S*)?$ 
// 验证电话号码：^(\(\d{3,4}\)|\d{3,4}-)?\d{7,8}$：--正确格式为：XXXX-XXXXXXX，XXXX-XXXXXXXX，XXX-XXXXXXX，XXX-XXXXXXXX，XXXXXXX，XXXXXXXX。 
// 验证身份证号（15位或18位数字）：^\d{15}|\d{}18$ 
// 验证一年的12个月：^(0?[1-9]|1[0-2])$ 正确格式为：“01”-“09”和“1”“12” 
// 验证一个月的31天：^((0?[1-9])|((1|2)[0-9])|30|31)$ 正确格式为：01、09和1、31。 
// 整数：^-?\d+$ 
// 非负浮点数（正浮点数 + 0）：^\d+(\.\d+)?$ 
// 正浮点数 ^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$ 
// 非正浮点数（负浮点数 + 0） ^((-\d+(\.\d+)?)|(0+(\.0+)?))$ 
// 负浮点数 ^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$ 
// 浮点数 ^(-?\d+)(\.\d+)?$
// 特殊字符 /[^\a-\z\A-\Z0-9\u4E00-\u9FA5-']/g

// 提取信息中的网络链接:(h|H)(r|R)(e|E)(f|F) *= *('|")?(\w|\\|\/|\.)+('|"| *|>)?
// 提取信息中的邮件地址:\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*
// 提取信息中的图片链接:(s|S)(r|R)(c|C) *= *('|")?(\w|\\|\/|\.)+('|"| *|>)?
// 提取信息中的IP地址:(\d+)\.(\d+)\.(\d+)\.(\d+)
// 提取信息中的中国手机号码:(86)*0*13\d{9}
// 提取信息中的中国固定电话号码:(\(\d{3,4}\)|\d{3,4}-|\s)?\d{8}
// 提取信息中的中国电话号码（包括移动和固定电话）:(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}
// 提取信息中的中国邮政编码:[1-9]{1}(\d+){5}
// 提取信息中的中国身份证号码:\d{18}|\d{15}
// 提取信息中的整数：\d+
// 提取信息中的浮点数（即小数）：(-?\d*)\.?\d+
// 提取信息中的任何数字 ：(-?\d*)(\.\d+)?
// 提取信息中的中文字符串：[\u4e00-\u9fa5]*
// 提取信息中的双字节字符串 (汉字)：[^\x00-\xff]*